## Plan Result (dev_frontdoor - TerraformPlanApply)




<pre><code>Plan: 32 to add, 17 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dev-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dev-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dev-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;dev-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;jd-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;portal-dev&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-video-web-pr-2142&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-video-web-reform&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dev-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dev-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dev-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;dev-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;jd-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;portal-dev&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-video-web-pr-2142&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-video-web-reform&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;jd-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-dev&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web-pr-2142&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web-reform&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/darts-portal"
        name                            = "darts-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dev-casetracker"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/devcasetrackercaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-casetracker"
        name                            = "dev-casetracker"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dev-certificatedbailiffs"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/devcertificatedbailiffscaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-certificatedbailiffs"
        name                            = "dev-certificatedbailiffs"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dev-courtfines"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/devcourtfinescaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-courtfines"
        name                            = "dev-courtfines"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["dev-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/devimmigrationappealsonlinecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-immigrationappealsonline"
        name                            = "dev-immigrationappealsonline"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["jd-bureau"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/jdbureaucaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/jd-bureau"
        name                            = "jd-bureau"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["jd-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/jdpubliccaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/jd-public"
        name                            = "jd-public"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["portal-dev"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/portal-dev"
        name                            = "portal-dev"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pre-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/pre-portal"
        name                            = "pre-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/sds-api-mgmt"
        name                            = "sds-api-mgmt"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["toffee"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/toffeecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/toffee"
        name                            = "toffee"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-admin-web"
        name                            = "vh-admin-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-test-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-test-web"
        name                            = "vh-test-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-video-web"
        name                            = "vh-video-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web-pr-2142"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-video-web-pr-2142"
        name                            = "vh-video-web-pr-2142"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web-reform"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/vhvideowebreformcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-video-web-reform"
        name                            = "vh-video-web-reform"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dartsportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dev-casetracker"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "devcasetrackerHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dev-certificatedbailiffs"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "devcertificatedbailiffsHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dev-courtfines"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "devcourtfinesHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["dev-immigrationappealsonline"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "devimmigrationappealsonlineHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["jd-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jdbureauHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["jd-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jdpublicHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["portal-dev"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "portaldevHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "preportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sdsapimgmtHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "toffeeHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhadminwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhtestwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhvideowebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-video-web-pr-2142"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhvideowebpr2142HstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-video-web-reform"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhvideowebreformHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "dartsportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dev-casetracker"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "devcasetrackerHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dev-certificatedbailiffs"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "devcertificatedbailiffsHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dev-courtfines"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "devcourtfinesHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["dev-immigrationappealsonline"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "devimmigrationappealsonlineHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["jd-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "jdbureauHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["jd-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "jdpublicHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["portal-dev"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "portaldevHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "preportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "sdsapimgmtHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "toffeeHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "vhadminwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "vhtestwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "vhvideowebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-video-web-pr-2142"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "vhvideowebpr2142HstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-video-web-reform"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev"
      + id                       = (known after apply)
      + name                     = "vhvideowebreformHstsRule"
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 32 to add, 17 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":918,"Program":"tfcmt","SHA1":"","Target":"dev_frontdoor - TerraformPlanApply","Vars":{}} -->